diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыИРеализации</name>
    <attributes>
      <name>Договоры</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбоненсткойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Метод получает массив структур, состоящих из договоров контрагентов и документов реализации товаров и услуг
// Параметры:
// Период- Дата
// Возвращаемое значение:
// Массив Из Структура:
//     Договор - СправочникСсылка.ДоговорыКонтрагентов,
//     Реализация - ДокументСсылка.РеализацияТоваровУслуг
Функция СоздатьДокументы(Период) Экспорт
	
	ТЗ_ДокИДог = ПолучитьДоговорыИРеализации(Период);
	
	МассивДляТЧ = Новый Массив;
	
	Для Каждого СтрокаТЗ Из ТЗ_ДокИДог Цикл 
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.РеализацияТоваровУслуг) Тогда
			
			МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СоздатьНовыйДокРеализации(СтрокаТЗ, Период)));
			Продолжить;
			
		КонецЕсли;
		
		МассивДляТЧ.Добавить(Новый Структура("Договор, Реализация", СтрокаТЗ.Договор, СтрокаТЗ.РеализацияТоваровУслуг));
		
	КонецЦикла;
	
	Возврат МассивДляТЧ;
	
КонецФункции

// Метод создает новую строку ТЧ обработки и заполняет данными из параметров
// Параметры:
// Договор - СправочникСсылка.ДоговорыКонтрагентов
// Реализация - ДокументСсылка.РеализацияТоваровУслуг
// ТабЧасть - ТабличнаяЧасть
Процедура ДобавитьСтрокуВТЧ(Договор, Реализация, ТабЧасть) Экспорт
	
	НоваяСтрокаТЧ = ТабЧасть.Добавить();
	НоваяСтрокаТЧ.Договоры = Договор;
	НоваяСтрокаТЧ.РеализацияТоваровУслуг = Реализация;
	
КонецПроцедуры

// Метод получает документы реализации и договоры на выбранный период
// Параметры: 
// Период - Дата
// Возвращаемое значение:
// ДокументСсылка.РеализацияТоваровУслуг
Функция ПолучитьДоговорыИРеализации(Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договоры
	|ПОМЕСТИТЬ вт_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Договоры.Договоры.Ссылка КАК Договор,
	|	вт_Реализация.Ссылка КАК РеализацияТоваровУслуг
	|ИЗ
	|	вт_Договоры КАК вт_Договоры
	|		ПОЛНОЕ СОЕДИНЕНИЕ вт_Реализация КАК вт_Реализация
	|		ПО вт_Договоры.Договоры.Ссылка = вт_Реализация.Ссылка.Договор";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Создание нового документа Реализации товаров и услуг
// Параметры:
// 	СтрокаТЗ - СтрокаТаблицыЗначений
// 	Период- Дата
// Возвращаемое значение:
// ДокументСсылка.РеализацияТоваровУслуг 
Функция СоздатьНовыйДокРеализации(СтрокаТЗ, Период) Экспорт

	НовыйДок = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДок.Заполнить(Неопределено);
	НовыйДок.Организация = СтрокаТЗ.Договор.Организация;
	НовыйДок.Контрагент = СтрокаТЗ.Договор.Владелец;
	НовыйДок.Договор = СтрокаТЗ.Договор;
	НовыйДок.Дата = Период;
	НовыйДок.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДок.Комментарий = "Этот документ создан групповой обработкой.";
	НовыйДок.ВКМ_ВыполнитьАвтозаполнение();
	
	Если НовыйДок.ПроверитьЗаполнение() Тогда
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Возврат НовыйДок.Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли
